In [2]:
import pandas as pd

In [3]:
pd.DataFrame({"name": ["ankit bharti", "rohit shrivastva"], "age": [26, 27]})

               name  age
0      ankit bharti   26
1  rohit shrivastva   27

In [4]:
pd.Series(['ankit bharti', 'rohit shrivastva', 'garima sharma', 'kailash kumar'])

0        ankit bharti
1    rohit shrivastva
2       garima sharma
3       kailash kumar
dtype: object

In [5]:
pd.Series([30, 40, 50], index=['Ankit', 'Rohit', 'Garima'], name='Friends')

Ankit     30
Rohit     40
Garima    50
Name: Friends, dtype: int64

In [6]:
pd['name']

TypeError: 'module' object is not subscriptable

In [7]:
pd.name

AttributeError: module 'pandas' has no attribute 'name'

In [11]:
friend = pd.read_csv('Friend.csv')

In [12]:
friend

               Name  Age    Address
0      Ankit Bharti   26  Hyderabad
1  Rohit Shrivastva   27       Pune

In [13]:
friend.shape

(2, 3)

In [15]:
friend.head()

               Name  Age    Address
0      Ankit Bharti   26  Hyderabad
1  Rohit Shrivastva   27       Pune

In [17]:
friend.head(1)

           Name  Age    Address
0  Ankit Bharti   26  Hyderabad

In [20]:
friend.tail(1)

               Name  Age Address
1  Rohit Shrivastva   27    Pune

In [22]:
fruits = pd.DataFrame({'Apples': [30], 'Bananas': [21]})

In [23]:
fruits

   Apples  Bananas
0      30       21

## 2.

Create a dataframe `fruit_sales` that matches the diagram below:

![](https://i.imgur.com/CHPn7ZF.png)

In [27]:
fruit_sale = pd.DataFrame({'Apples': [35, 41], 'Bananas': [21, 34]}, index=['2017 Sales', '2018 Sales'])

In [28]:
fruit_sale

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

## 3.

Create a variable `ingredients` with a Series that looks like:

```
Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object
```

In [31]:
ingredients = pd.Series(['4 cups', '1 cup', '2 large', '1 can'], index=['Flour', 'Milk', 'Eggs', 'Spam'], name='Dinner')

In [32]:
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [34]:
fruit_sale.to_csv('fruit_sale.csv')

In [35]:
fruit_sale.Apples

2017 Sales    35
2018 Sales    41
Name: Apples, dtype: int64

In [36]:
fruit_sale['Apples']

2017 Sales    35
2018 Sales    41
Name: Apples, dtype: int64

In [37]:
fruit_sale['Apples'][0]

35

In [38]:
fruit_sale['Apples'][1]

41

In [40]:
fruit_sale['Apples'][-1]

41

In [42]:
fruit_sale.iloc[0]

Apples     35
Bananas    21
Name: 2017 Sales, dtype: int64

In [43]:
fruit_sale.iloc[0:1]

            Apples  Bananas
2017 Sales      35       21

In [44]:
fruit_sale.iloc[0:2]

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [45]:
fruit_sale.iloc[1]

Apples     41
Bananas    34
Name: 2018 Sales, dtype: int64

In [47]:
fruit_sale.iloc[0:, 1]

2017 Sales    21
2018 Sales    34
Name: Bananas, dtype: int64

In [67]:
fruit_sale.loc['2018 Sales', 'Apples']

41

In [68]:
friends = pd.DataFrame({'ankit': [26, 27, 28], 'rohit': [31, 32, 33]})

In [69]:
friends

   ankit  rohit
0     26     31
1     27     32
2     28     33

In [70]:
friends.loc[0, 'ankit']

26

In [71]:
friends.loc[0:2, 'rohit']

0    31
1    32
2    33
Name: rohit, dtype: int64

In [72]:
friends.iloc[0:2]

   ankit  rohit
0     26     31
1     27     32

In [73]:
friends.iloc[0:2]['ankit']

0    26
1    27
Name: ankit, dtype: int64

In [74]:
friends.set_index('Title')

KeyError: "None of ['Title'] are in the columns"

In [75]:
friends.set_index('rohit')

       ankit
rohit
31        26
32        27
33        28

In [76]:
friends.set_index(['ankit', 'rohit'])

Empty DataFrame
Columns: []
Index: [(26, 31), (27, 32), (28, 33)]

In [77]:
friends.ankit == 26

0     True
1    False
2    False
Name: ankit, dtype: bool

In [78]:
friends.ankit >= 26

0    True
1    True
2    True
Name: ankit, dtype: bool

In [79]:
friends.ankit > 26

0    False
1     True
2     True
Name: ankit, dtype: bool

In [80]:
friends.loc[friends.ankit > 26]

   ankit  rohit
1     27     32
2     28     33

In [81]:
friends.loc[friends.ankit > 26, 'rohit']

1    32
2    33
Name: rohit, dtype: int64

In [83]:
friends.loc[(friends.ankit > 26) & (friends.ankit % 2 == 0)]

   ankit  rohit
2     28     33

In [84]:
friends.loc[friends.ankit.isin([27, 28])]

   ankit  rohit
1     27     32
2     28     33